
//二进制转10进制
let a = 0b1001
//公式
/*  
  1*2的0次方
  0*2的1次方
  0*2的2次方
  1*2的三次方
*/
// console.log(a)//9 1+0+0+8 

//10进制转2进制
let Ta = 10;
// console.log(Ta.toString(2));//1010
/* 
  10/2=5 余数为0
  5/2 = 2 余数为1
  2/2 = 1 余数为0
  1/2 = 0 余数为1
  然后采取倒叙的方式就是我们得到的二进制 1010
*/
//=======================================
//八进制（0-7)
//八进制转十进制跟二进制转10进制一个道理
let Ea = 0o24
// console.log(Ea)//20

//==========================================
//十六进制(0-9a-f)

let c = 0x14
// console.log(c);//20

//JS中进制转换的方法

//各种进制转换为10进制
parseInt("进制的数字","需要进制")
console.log(parseInt(a))
//10进制转换为各种禁止
// x.toString("进制度")
let t = 20
console.log(t.toString(16))

console.log(parseInt(10010,2))